{
  "backend/main.mo": "Motoko backend actor managing access control, user profiles, inquiries, WhatsApp queries, bookings, and shipment tracking with permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature removals and related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files for reference or documentation.",
  "frontend/index.css": "Global Tailwind-based styling with CSS variables for light/dark themes and base element rules.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, root div, and module script loader.",
  "frontend/src/App.tsx": "Main React component assembling all site sections into a single-page layout.",
  "frontend/src/components/site/gallery/GalleryLightbox.tsx": "Empty or placeholder file with no implemented component.",
  "frontend/src/components/site/sections/AboutSection.tsx": "Renders an About Us section with company description and a grid of value cards using icons.",
  "frontend/src/components/site/sections/BookingSection.tsx": "Implements a booking form with validation, submission handling, and UI for scheduling delivery pickups.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Provides a contact form with validation, inquiry submission, and WhatsApp message integration.",
  "frontend/src/components/site/sections/CourierPartnersSection.tsx": "Empty section file with no implemented content.",
  "frontend/src/components/site/sections/CoverageSection.tsx": "Displays service coverage areas, delivery info cards, and a nationwide pickup banner.",
  "frontend/src/components/site/sections/GallerySection.tsx": "Empty section file with no implemented content.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Renders the hero banner with headline, call-to-action buttons, stats, and a featured image.",
  "frontend/src/components/site/sections/LabelPrintSection.tsx": "Provides a tracking number lookup to load and print shipping labels with error and not-found states.",
  "frontend/src/components/site/sections/ServicesSection.tsx": "Displays a services section with cards listing service categories, descriptions, icons, and features.",
  "frontend/src/components/site/sections/TrackingSection.tsx": "Provides a shipment tracking UI with a search form, API lookup via useTrackingInfo, and status display.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand info, quick links, services list, contact details, and attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive site header with branding, navigation links, mobile menu, and smooth scrolling.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Sets up Internet Identity context, handling login, stored identities, and auth client configuration.",
  "frontend/src/hooks/useLabelDetails.ts": "Fetches label details for a tracking number using the backend actor and react-query.",
  "frontend/src/hooks/useOneShotTimeout.ts": "Runs a one-time timeout callback when triggered, preventing duplicate timers across rerenders.",
  "frontend/src/hooks/useSubmitBooking.ts": "Submits booking data to the backend actor and invalidates booking queries on success.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Sends an inquiry to the backend actor and invalidates inquiry-related queries.",
  "frontend/src/hooks/useSubmitWhatsAppQuery.ts": "Submits WhatsApp query data to the backend actor and invalidates related queries.",
  "frontend/src/hooks/useTrackingInfo.ts": "Fetches shipment tracking info for a tracking number using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, layout utilities, and print styles.",
  "frontend/src/lib/validation/booking.ts": "Validates booking form fields for sender, receiver, locations, package details, and pickup time, returning errors and validity status.",
  "frontend/src/lib/validation/contactInquiry.ts": "Validates contact inquiry form fields for name, phone, email, and message, returning errors and validity status.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsapp.ts": "Builds prefilled WhatsApp messages and generates wa.me URLs with encoded message content.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines project state metadata including features, new requests, issues, and project configuration."
}