{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, inquiries, WhatsApp queries, bookings, and shipment tracking with map/list storage and admin/user permissions.",
  "feature_evidence.json": "Feature evidence report linking a header brand/logo sizing adjustment to its source file and associated components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files including styling, config, components, hooks, and sections.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode overrides, and global UI element defaults.",
  "frontend/index.html": "HTML entry point providing root container, favicon, metadata, and script loader for the React app.",
  "frontend/src/App.tsx": "Main React app composing all site sections with a header, footer, and full-page marketing layout.",
  "frontend/src/components/site/gallery/GalleryLightbox.tsx": "Empty placeholder file for a gallery lightbox component.",
  "frontend/src/components/site/sections/AboutSection.tsx": "About section outlining company story and core values with icons and descriptive text.",
  "frontend/src/components/site/sections/BookingSection.tsx": "Renders a full booking form with validation, submission handling, and automatic reset after success.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Provides a contact form with validation, backend submission, and WhatsApp message integration.",
  "frontend/src/components/site/sections/CourierPartnersSection.tsx": "Empty section file with no implemented content.",
  "frontend/src/components/site/sections/CoverageSection.tsx": "Displays service coverage areas, delivery info, and a nationwide pickup banner using cards and icons.",
  "frontend/src/components/site/sections/GallerySection.tsx": "Empty section file with no implemented content.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Shows the homepage hero banner with headline, call-to-action buttons, stats, and a large hero image.",
  "frontend/src/components/site/sections/LabelPrintSection.tsx": "Implements tracking number search, label loading, error states, and print functionality.",
  "frontend/src/components/site/sections/ServicesSection.tsx": "Displays a grid of service offerings with icons, descriptions, and feature lists.",
  "frontend/src/components/site/sections/TrackingSection.tsx": "Renders a shipment tracking UI with a tracking number form and displays status results via useTrackingInfo.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand info, quick links, services list, contact details, and social icons.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive header with brand block, desktop/mobile navigation, smooth scrolling, and a Book Now CTA.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout.",
  "frontend/src/hooks/useLabelDetails.ts": "Fetches label details for a tracking number using the backend actor.",
  "frontend/src/hooks/useOneShotTimeout.ts": "Runs a one-time delayed callback when a trigger becomes true, with cleanup and stable references.",
  "frontend/src/hooks/useSubmitBooking.ts": "Submits booking data through the backend actor and invalidates related queries on success.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Sends an inquiry to the backend actor and invalidates inquiry queries afterward.",
  "frontend/src/hooks/useSubmitWhatsAppQuery.ts": "Submits a WhatsApp-related query via the backend actor and invalidates corresponding queries.",
  "frontend/src/hooks/useTrackingInfo.ts": "Retrieves shipment tracking information for a tracking number using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theme variables, dark mode, layout utilities, and print styles.",
  "frontend/src/lib/validation/booking.ts": "Validates booking form fields and returns errors for missing or invalid sender/receiver and package info.",
  "frontend/src/lib/validation/contactInquiry.ts": "Validates contact inquiry fields for required and well‑formed name, phone, email, and message.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), store/retrieve them in sessionStorage, and clear parameters from URL or storage.",
  "frontend/src/utils/whatsapp.ts": "Generates prefilled WhatsApp message text and constructs wa.me URLs with encoded messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "JSON file describing project metadata, feature tracking, and current project state."
}