{
  "backend/main.mo": "Actor defines an Inquiry type, stores inquiries in a List, and exposes submit and query methods.",
  "feature_evidence.json": "Feature evidence report describing a logo asset addition with related components and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files including styles, components, hooks, and HTML entry.",
  "frontend/index.css": "Tailwind base styles plus OKLCH variable-driven light/dark theme definitions and global background/foreground setup.",
  "frontend/index.html": "HTML entry with favicon references and script loading the React app root.",
  "frontend/src/App.tsx": "Root React component composing header, all site sections, and footer.",
  "frontend/src/components/site/sections/AboutSection.tsx": "About section with company overview and a grid of four value cards.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Contact section providing business info cards and a validated inquiry form submitted via a mutation hook.",
  "frontend/src/components/site/sections/CoverageSection.tsx": "Displays coverage areas, delivery info cards, and a nationwide pickup banner for the logistics site.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Renders the hero banner with headline, description, CTA buttons, stats, and a hero image.",
  "frontend/src/components/site/sections/ServicesSection.tsx": "Shows a grid of service cards detailing logistics and delivery offerings with icons and features.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand details, navigation links, services list, contact info, and bottom attribution bar.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive header with logo, desktop navigation buttons, and mobile sheet menu using smooth-scroll behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, updating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and persisted identity handling.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Defines a mutation that sends inquiry data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Tailwind CSS setup with light/dark theme variables, global styles, and layout utility classes.",
  "frontend/src/lib/validation/contactInquiry.ts": "Validates contact form fields for name, phone, email, and message, returning errors and validity status.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing logo-related issues, required assets, and pending feature requests to restore branding and favicon functionality."
}