{
  "backend/main.mo": "Actor implementing access-controlled user profiles, inquiries, WhatsApp queries, shipments, and bookings with various data types and CRUD-like endpoints.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short functional descriptions for documentation or tooling.",
  "frontend/index.css": "Tailwind base setup defining OKLCH design tokens, light/dark theme variables, and global element styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Composes the full single-page site by rendering all major sections between header and footer.",
  "frontend/src/components/site/gallery/GalleryLightbox.tsx": "Modal lightbox that displays a selected image and closes on escape or dialog close.",
  "frontend/src/components/site/sections/AboutSection.tsx": "Renders an About section with company description and a grid of core values with icons.",
  "frontend/src/components/site/sections/BookingSection.tsx": "Booking form section handling validation, submission, and auto-reset using custom hooks.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Contact form section supporting email submission and WhatsApp message generation with validation.",
  "frontend/src/components/site/sections/CourierPartnersSection.tsx": "Displays courier partners and enables sending WhatsApp inquiries after backend logging.",
  "frontend/src/components/site/sections/CoverageSection.tsx": "Shows service coverage areas and delivery info with icons and styled cards.",
  "frontend/src/components/site/sections/GallerySection.tsx": "Image gallery that opens selected images in a lightbox for preview.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Renders the homepage hero with marketing text, CTA buttons, and a banner image, including smooth-scroll to contact.",
  "frontend/src/components/site/sections/LabelPrintSection.tsx": "Provides a form to fetch shipping label details by tracking number and supports previewing and printing labels.",
  "frontend/src/components/site/sections/ServicesSection.tsx": "Displays a grid of service cards describing logistics offerings with icons and feature lists.",
  "frontend/src/components/site/sections/TrackingSection.tsx": "Implements shipment tracking with a search form, status display, and error/not-found states using tracking API data.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with brand info, quick links including Gallery, services list, contact details, and social icons.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive header with desktop and mobile navigation including Gallery and smooth-scroll behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useLabelDetails.ts": "Fetches label details for a tracking number via the backend actor using react-query.",
  "frontend/src/hooks/useOneShotTimeout.ts": "Runs a one-time timeout callback when a trigger becomes true, preventing duplicate scheduling across renders.",
  "frontend/src/hooks/useSubmitBooking.ts": "Submits booking data through the backend actor and invalidates booking queries on success.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Defines a React Query mutation hook that submits an inquiry via the actor and invalidates the inquiries cache.",
  "frontend/src/hooks/useSubmitWhatsAppQuery.ts": "Provides a mutation hook to submit WhatsApp-related queries through the actor and invalidate the whatsappQueries cache.",
  "frontend/src/hooks/useTrackingInfo.ts": "Fetches shipment tracking information using React Query and the actor, keyed by tracking number.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, components, dark mode settings, and print-specific layout rules.",
  "frontend/src/lib/validation/booking.ts": "Validates booking form fields and returns error messages for missing or invalid input.",
  "frontend/src/lib/validation/contactInquiry.ts": "Validates contact inquiry form fields including name, phone, email, and message.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, importing global styles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing, persisting, and clearing URL and session parameters.",
  "frontend/src/utils/whatsapp.ts": "Builds WhatsApp message text and generates wa.me URLs with encoded content.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, plugins, and animations.",
  "project_state.json": "Describes the project state, existing features, pending requests, and metadata for the gallery feature work."
}