{
  "backend/main.mo": "Motoko backend defining user profiles, inquiries, WhatsApp queries, bookings, and shipment tracking with access‑controlled CRUD APIs.",
  "feature_evidence.json": "Feature evidence report linking a favicon addition to affected frontend file and related components.",
  "frontend-file-summaries.txt": "JSON-style list summarizing multiple frontend files and their roles across styling, sections, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark themes, and global layout styles.",
  "frontend/index.html": "Main HTML entry with favicon link and script mounting the React app.",
  "frontend/src/App.tsx": "Top-level React component composing all site sections and layout.",
  "frontend/src/components/site/gallery/GalleryLightbox.tsx": "Lightbox dialog for viewing gallery images with escape handling and close controls.",
  "frontend/src/components/site/sections/AboutSection.tsx": "Renders an About Us section with company values, descriptive text, and a grid of value cards using icons.",
  "frontend/src/components/site/sections/BookingSection.tsx": "Implements a delivery booking form with validation, submission handling, and auto-reset after success.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Provides a contact form with validation, inquiry submission, and WhatsApp message integration.",
  "frontend/src/components/site/sections/CourierPartnersSection.tsx": "Displays courier partners and enables sending pre-filled WhatsApp queries via backend submission.",
  "frontend/src/components/site/sections/CoverageSection.tsx": "Shows delivery coverage areas, service info, and nationwide pickup details with icon-enhanced cards.",
  "frontend/src/components/site/sections/GallerySection.tsx": "Presents a small image gallery with lightbox functionality for viewing selected images.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Landing hero section with headline, stats, and buttons that scroll to the contact section.",
  "frontend/src/components/site/sections/LabelPrintSection.tsx": "Form to load label details by tracking number and print them, with loading, error, and not‑found states.",
  "frontend/src/components/site/sections/ServicesSection.tsx": "Displays a grid of service cards with icons, descriptions, and feature lists.",
  "frontend/src/components/site/sections/TrackingSection.tsx": "Tracking form that fetches shipment info and shows status, errors, and not‑found messages.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer component with branding, navigation links, services list, contact info, and social icons.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive header with brand, desktop/mobile nav, and smooth-scroll navigation controls.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, stored identity loading, and state management.",
  "frontend/src/hooks/useLabelDetails.ts": "React Query hook that fetches label details from the backend actor using a tracking number.",
  "frontend/src/hooks/useOneShotTimeout.ts": "Schedules a single-run timeout triggered by a boolean flag with cleanup and stable callback handling.",
  "frontend/src/hooks/useSubmitBooking.ts": "Mutation hook to submit booking data via the backend actor and invalidate booking queries on success.",
  "frontend/src/hooks/useSubmitInquiry.ts": "React Query mutation hook that submits an inquiry through the actor and invalidates the inquiries cache.",
  "frontend/src/hooks/useSubmitWhatsAppQuery.ts": "React Query mutation hook that submits a WhatsApp inquiry via the actor and invalidates the WhatsApp queries cache.",
  "frontend/src/hooks/useTrackingInfo.ts": "Fetches shipment tracking info from the actor using React Query with conditional enabling.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, dark mode settings, component utilities, and print styles.",
  "frontend/src/lib/validation/booking.ts": "Validates booking form fields with rules for sender, receiver, locations, package details, and pickup time.",
  "frontend/src/lib/validation/contactInquiry.ts": "Validates contact inquiry form fields including name, phone, email, and message.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider, and React Query client.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, supporting hash routing.",
  "frontend/src/utils/whatsapp.ts": "Builds prefilled WhatsApp message text and generates wa.me URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with theming, colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata and feature tracking for adding a favicon to the frontend."
}