{
  "kind": "build_request",
  "title": "Remove Courier Partners section from the site",
  "projectName": "ML Enterprise Site",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Remove the Courier Partners section from the single-page layout so it no longer renders on the page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove courier partner"
        ]
      },
      "acceptanceCriteria": [
        "The Courier Partners section is no longer rendered in the main page flow (it should not appear between Coverage and Tracking anymore).",
        "The Courier Partners section does not appear in the DOM and cannot be reached by scrolling."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Remove the \"Courier Partners\" navigation link so the header navigation no longer includes a link to \"#courier-partners\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove courier partner"
        ]
      },
      "acceptanceCriteria": [
        "Desktop navigation no longer shows a \"Courier Partners\" link.",
        "Mobile navigation no longer shows a \"Courier Partners\" link.",
        "No navigation action attempts to scroll to \"#courier-partners\"."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure there are no remaining in-app references to the Courier Partners section anchor (\"#courier-partners\") that could cause broken navigation or dead links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove courier partner"
        ]
      },
      "acceptanceCriteria": [
        "No UI element attempts to scroll to or reference \"#courier-partners\".",
        "The page navigation and scrolling behavior continues to work for all remaining sections (Home, Services, About, Coverage, Tracking, Label Print, Booking, Contact)."
      ]
    }
  ],
  "constraints": [
    "Frontend files listed as immutable in SYSTEM_CONTEXT must not be edited (compose instead).",
    "Keep the existing single-page section anchor navigation behavior for all remaining sections."
  ],
  "nonGoals": [
    "Do not change backend Motoko APIs or stored data related to WhatsApp queries unless required for compilation.",
    "Do not redesign or alter other site sections beyond removing the Courier Partners section and its navigation link."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}